<template>
  <div class="full-container">
    <CodeLayoutScrollbar>
      <div class="text">
        <p>如果说有什么东西在折磨着她，那就是一日三餐的永久惩罚。因为它们不仅仅必须按时，而且必须完美无瑕，必须符合他的喜好，但同时又不能去问他。而如果她真的问了——依照着那无数条仪式性的家庭礼节中的一条——他就会看着报纸，连眼皮也不抬地回答说：“随便什么都行。”他说的是真心话，而且和颜悦色，自认为没有哪个丈夫比他更好商量了。可到了吃饭的时候，“随便什么”就不行了，必须符合他的喜好，不能有半点瑕疵：肉不能有肉味儿，鱼不能有鱼味儿，猪肉不能吃出来疥疮的似的腥味，鸡肉不能吃出鸡毛的味道。即使不是吃芦笋的季节，也得不惜代价地为他找来，为的是让他能在自己的尿液的芬芳气息中怡然自得。她不怨他，只怨生活。但他是生活中难以安抚的主角。只要稍有怀疑，他就会把桌子上的盘子一推，说：“这顿饭没有用爱来做。”在这方面，他的灵感真是鬼使神差。有一次，他刚尝了一口甘菊茶，便把它推到远处，只说了一句：“这玩意儿有股窗户味儿。”她和女仆们都大吃一惊，因为谁也没喝过水煮窗户，她们尝了尝那壶茶，想弄明白是怎么回事，结果，还真有股窗户味儿。</p>
        <p>他是个完美丈夫：从不会捡起地上的任何东西，也从不关灯，不关门。黑暗的清晨，如果他发现衣服上缺了一颗纽扣，她便会听见他说：“男人需要两个妻子，一个用来爱，一个用来钉扣子。”每天，当他喝第一口咖啡，喝第一勺冒着热气的汤时，都要发出一声撕心裂肺的号叫，大家对此已经不感到害怕了，接着他会长叹一声：“等我有一天离开了这个家，你们要明白，那是因为这种烫嘴的日子我过够了。”他说，只有在他服用泻药而不能吃饭的日子里，她们才把饭菜做得格外香，格外出色。他坚信这是妻子对他的背叛，以至于最后只要妻子不肯跟他一同吃泻药，他就坚决不吃。</p>
        <p>他的不通情理让她十足厌烦，于是在生日那天，她向他要了一件不同寻常的礼物：由他掌管一天家务。他欣然接受了，而且果真从天一亮就开始掌权。他张罗了一顿丰富的早餐，却忘了她不喜欢吃煎鸡蛋，也不喝加了牛奶的咖啡。接着，他下令开始准备招待八位客人的生日午宴，并吩咐收拾屋子。他努力想比她操持得更好，但不到中午就不得不投降了，脸上没有丝毫愧色。从一开始，他就发现自己对什么东西放在哪儿一无所知，尤其是厨房里的东西。而女仆们也从中取乐，任由他每次为了找一样东西把所有都翻遍。十点钟时，还没决定午餐吃什么，因为家里的卫生还没有搞完，甚至连卧室都没有收拾完，卫生间没刷，卫生纸忘了放，床单忘了换，还忘了派司机去接孩子。他把女仆们的全职全搞混了：命令厨娘去整理床铺，让收拾床铺的女佣去做饭。十一点，客人马上就要到了，家里还是一团糟。费尔明娜.达萨重新担起了指挥的职责。她笑的要死，但并不像之前期望的那样感觉到胜利的得意，而是为丈夫在管理家务方面一无是处感到同情，这让她自己也很震惊。他为自己所受的重创叹了口气，找了个常用的理由来辩解：“至少，我管家不会比你给人治病差。”不过，这次的教训是有益的，而且不仅仅对他而言。随着时间的推移，两人殊途同归地得出了明智的结论，那就是：换一种方式，他们无法共同生活下去，换一种方式，他们也无法继续相爱——世上没有比爱更艰难的事了。</p>
        <p>节选自《霍乱时期的爱情》加西亚.马尔克斯</p>
      </div>
    </CodeLayoutScrollbar>
  </div>
</template>

<script setup lang="ts">
import CodeLayoutScrollbar from 'vue-code-layout';

</script>

<style scoped>
.full-container {
  position: relative;
  width: 100%;
  height: 100%;
  overflow: hidden;
}
.text {
  width: 800px;
  margin: 0 auto;
  font-size:16px;
  text-indent:34px;
  line-height: 32px;
}
</style>